#!/user/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2018/11/20 10:39
# @Author   : sun.jianshi
# @File     : RunDemo.py
# @Software : PyCharm
import cx_Oracle as oracle
from IPython import embed

def get_car_type_229(sql):
    db = oracle.connect('bq_data', 'tiger', '39.107.57.229:1521/orcl.lan')
    cursor = db.cursor()
    print(sql)
    data = None
    try:
        cursor.execute(sql)
        data = cursor.fetchall()
    except Exception as e:
        print(e)
    db.commit()
    cursor.close()
    db.close()
    return data

def get_car_type_141(sql):
    db = oracle.connect('beiqi_vmda', 'tiger', '47.93.122.141:1521/orcl')
    cursor = db.cursor()
    print(sql)
    data = None
    try:
        cursor.execute(sql)
        data = cursor.fetchall()
    except Exception as e:
        print(e)
    db.commit()
    cursor.close()
    db.close()
    return data

def get_url():

    str_url = "https://car.autohome.com.cn/config/series/{}.html"
    str_list = []
    url_dict = {}
    sql = "select car_name from car_info"
    car_name_tuple = get_car_type_141(sql)
    for car_name in car_name_tuple:
        sql = "SELECT CARTYPE, CARID from CRAW_KB_CARID2CARTYPE WHERE CARTYPE = '%s'"%(car_name[0])
        data = get_car_type_229(sql)
        for item in data:
            url = str_url.format(item[1])
            print(url)
            str_list.append(url)
            url_dict[item[0]] = url
    return str_list
# print(str_list)
# print(url_dict)
# b = ('BJ 212', 'C4世嘉', 'DS 3', 'DS 4S', 'DS 5(进口)', 'DS 6', 'EC系列', 'ENCINO 昂希诺', 'EU系列', 'EV系列', 'EX系列', 'FJ 酷路泽', 'INSPIRE', 'MINI', 'Mattu', 'U6 TURBO', 'V5菱致', 'WEY VV5', 'WEY VV6', 'WEY VV7', 'smart fortwo', '世嘉', '东南DX7', '东风小康C36', '东风风光', '东风风度MX5', '东风风神A30', '东风风神AX3', '东风风神L60', '中华EV', '中华V3', '中华V5', '中华V7', '丰田C-HR', '乐风RV', '五十铃皮卡', '五菱宏光', '五菱荣光V', '伊兰特', '众泰T200', '众泰T300', '众泰T500', '众泰T600', '众泰T700', '众泰Z100', '众泰Z500', '众泰Z700', '传祺GA3', '传祺GA4', '传祺GA5', '传祺GA6', '传祺GA8', '传祺GM8', '传祺GS3', '传祺GS4', '传祺GS5', '传祺GS5 Super', '传祺GS7', '传祺GS8', '保时捷911', '傲虎', '元', '兰德酷路泽', '冠道', '凌派', '凌渡', '凌轩', '凯美瑞', '凯翼E3', '凯翼X3', '凯翼X5', '凯越', '凯迪拉克ATS-L', '凯迪拉克CT6', '凯迪拉克CTS(进口)', '凯迪拉克XT4', '凯迪拉克XT5', '凯迪拉克XTS', '创酷', '别克GL6', '别克GL8', '前途K50', '力帆650EV', '力帆X70', '劲客', '勇士', '北京BJ40', '北京BJ80', '北京BW007', '北斗星', '北汽威旺608EV', '北汽幻速H6', '北汽幻速S2', '北汽幻速S6', '北汽新能源EU5', '北汽新能源EX3', '华泰iEV230', '博瑞', '博越', '卡罗拉', '发现神行', '吉利GX7', '吉利SX7', '吉姆尼(进口)', '名图', '名爵3', '名爵6', '名爵ZS', '君威', '君越', '君马S70', '启悦', '启辰D50', '启辰D60', '启辰R30', '启辰R50', '启辰T70', '启辰T90', '哈弗F5', '哈弗F7', '哈弗H1', '哈弗H2', '哈弗H4', '哈弗H5', '哈弗H6', '哈弗H7', '哈弗H9', '哈弗M6', '哥瑞', '唐', '圣达菲', '域虎7', '夏朗', '大7 MPV', '大众CC', '大众up!', '大切诺基', '大指挥官', '大迈X5', '大迈X7', '天籁', '奇瑞E3', '奇骏', '奔奔', '奔奔EV', '奔腾B30', '奔腾T77', '奔腾X40', '奔腾X80', '奔驰A级', '奔驰B级', '奔驰CLA级', '奔驰CLK级', '奔驰CLS级', '奔驰CSC级', '奔驰C级', '奔驰GLA', '奔驰GLC', '奔驰GLS', '奔驰G级', '奔驰R级', '奔驰SLK级', '奔驰SL级', '奔驰S级', '奔驰V级', '奕跑', '奥德赛', '奥迪A1', '奥迪A3', '奥迪A4L', '奥迪A5', '奥迪A6L', '奥迪A7', '奥迪A8', '奥迪Q2L', '奥迪Q3', '奥迪Q7', '奥迪TT', '威朗', '威霆', '威驰', '威驰FS', '宋', '宋MAX', '宝来', '宝沃BX5', '宝沃BX7', '宝马1系', '宝马2系', '宝马3系', '宝马3系GT', '宝马4系', '宝马5系GT', '宝马6系', '宝马7系', '宝马8系', '宝马X1', '宝马X2', '宝马X3', '宝马X4', '宝马X5', '宝马X6', '宝马Z4', '宝马i3', '宝马i8', '宝骏310', '宝骏330', '宝骏510', '宝骏560', '宝骏610', '宝骏630', '宝骏730', '宝骏E100', '小鹏汽车G3', '帅客', '帅铃T6', '帕拉丁', '帕杰罗', '帕萨特', '帝豪', '帝豪GL', '帝豪GS', '帝豪新能源', '征途', '思域', '思铂睿', '悦动', '悦纳', '悦翔V7', '战旗', '拓陆者', '指南者', '捷豹F-TYPE', '捷豹XEL', '捷豹XF', '捷豹XFL', '捷豹XJ', '捷达', '捷途X70', '探岳', '探界者', '揽福', '揽胜', '揽胜极光', '揽胜运动版', '撼路者', '斯巴鲁BRZ', '斯巴鲁XV', '昂科威', '昂科拉', '昂科雷', '昌河北斗星', '明锐', '昕动', '昕锐', '晨风', '普拉多', '景逸', '景逸S50', '景逸SUV', '景逸X3', '景逸X5', '晶锐', '智跑', '朗动', '朗境', '朗行', '朗逸', '本田CR-V', '本田CR-Z', '本田UR-V', '本田XR-V', '杰德', '林肯MKS', '林肯MKT', '林肯MKZ', '柯珞克', '柯米克', '柯迪亚克', '标致2008', '标致208', '标致301', '标致307', '标致308', '标致308S', '标致4008', '标致408', '标致5008', '桑塔纳', '森林人', '森雅R7', '森雅R9', '楼兰', '欧尚', '欧尚A800', '欧拉iQ', '欧诺', '欧陆', '比亚迪F3', '比亚迪F6', '比亚迪L3', '比亚迪S7', '比速T3', '比速T5', '汉兰达', '汉腾X5', '汉腾X7', '江淮iEV', '江淮iEV6S', '沃兰多', '沃尔沃C30', '沃尔沃C70', '沃尔沃S40', '沃尔沃S60L', '沃尔沃S80', '沃尔沃S90', '沃尔沃V40', '沃尔沃V90', '沃尔沃XC40', '沃尔沃XC60', '沃尔沃XC70', '沃尔沃XC90', '海马M3', '海马M6', '海马M8', '海马S7', '海马V70', '海马爱尚EV', '焕驰', '爱丽舍', '牧马人', '猎豹CS10', '猎豹CS9', '猎豹Q6', '猛士', '瑞奕', '瑞纳', '瑞虎', '瑞虎3', '瑞虎3xe', '瑞虎5', '瑞虎7', '瑞虎8', '瑞迈', '瑞风', '瑞风M5', '瑞风M6', '瑞风S2', '瑞风S3', '瑞风S5', '瑞风S7', '皇冠', '睿翼', '睿骋', '睿骋CC', '知豆', '知豆D2', '神行者', '神行者2', '福瑞迪', '福睿斯', '福美来', '科沃兹', '科雷傲', '科雷嘉', '科鲁兹', '秦', '竞瑞', '索兰托', '索纳塔九', '索纳塔八', '红旗H5', '红旗H7', '红旗LS5', '红杉', '绅宝CC', '绅宝D50', '绅宝D60', '绅宝D70', '绅宝D80', '绅宝X25', '绅宝X35', '绅宝X55', '绅宝X65', '绅宝智行', '绅宝智道', '维特拉', '缤智', '缤瑞', '缤越', '翼虎', '胜达', '腾势', '自由侠', '自由光', '自由客', '艾力绅', '艾瑞泽3', '艾瑞泽5', '艾瑞泽7', '艾瑞泽GX', '艾瑞泽M7', '英朗', '英致737', '英致G5', '英菲尼迪QX', '英菲尼迪QX30', '荣威350', '荣威360', '荣威550', '荣威950', '荣威Ei5', '荣威RX3', '荣威RX8', '荣威W5', '荣威e550', '荣威e950', '荣威i5', '荣威i6', '菲斯塔', '萨瓦纳', '蒙迪欧', '蒙迪欧-致胜', '蓝鸟', '蔚揽', '蔚来ES8', '观致', '观致3', '观致5', '赛拉图', '起亚CUB', '起亚K2', '起亚K3', '起亚K4', '起亚K5', '起亚K9', '起亚KX3', '起亚KX5', '路盛E70', '轩朗', '轩逸', '辉昂', '迈威', '迈腾', '迈锐宝', '迈锐宝XL', '远景', '远景S1', '远景SUV', '远景X1', '远景X3', '逍客', '途乐', '途安', '途岳', '途昂', '途睿欧', '途胜', '途观', '途达', '途锐', '速派', '速腾', '速锐', '逸动', '逸动DT', '逸动XT', '逸致', '野马T80', '金牛座', '锋范', '锐3', '锐志', '锐界', '锐腾', '锐行', '锐骐皮卡', '长城C30', '长安CS35', '长安CS55', '长安CS75', '长安CS95', '阁瑞斯', '阅朗', '阿特兹', '雅阁', '雨燕', '雪铁龙C3', '雷克萨斯CT', '雷克萨斯ES', '雷克萨斯GS', '雷克萨斯GX', '雷克萨斯IS', '雷克萨斯LS', '雷克萨斯LX', '雷克萨斯NX', '雷克萨斯RX', '雷凌', '霸锐', '领克01', '领克02', '领克03', '领动', '领航员', '风云2', '风景', '风行CM7', '风行F600', '风行S500', '风行SX6', '风骏5', '风骏6', '风骏7', '飞度', '马自达2', '马自达3 Axela昂克赛拉', '马自达5', '马自达6', '马自达CX-3', '马自达CX-4', '马自达CX-5', '马自达RX-8', '驭胜S350', '骁途', '骊威', '骏派A50', '骏派D60', '骐达', '骐铃T3', '骐铃T5', '骐铃T7', '高尔夫')
# sql = "select car_name from car_info where car_name not in {}".format(b)
#
# data = get_car_type_141(sql)
# s = []
# for i in data:
#     s.append(i[0])
# url = get_url()
# print(url)
# embed()

